Диплом/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Диплом/src/Enums/ВКМ_КатегорияСотрудника/ВКМ_КатегорияСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_КатегорияСотрудника</name>
  <enumValues>
    <name>Специалист</name>
  </enumValues>
  <enumValues>
    <name>АдминистративныйПерсонал</name>
  </enumValues>
</mdclass:Enum>

Диплом/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура ВидимостьПроцента()     
	
	КатегорияСотрудников = КатегорияСотрудника();
	Если КатегорияСотрудников = ПредопределенноеЗначение("Перечисление.ВКМ_КатегорияСотрудника.Специалист") Тогда 
		Элементы.ПроцентОтРабот.Видимость = Истина;
	Иначе 
		Элементы.ПроцентОтРабот.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция КатегорияСотрудника()
				
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ФизическиеЛица.КатегорияСотрудников КАК КатегорияСотрудников
		|ИЗ
		|	Справочник.ВКМ_ФизическиеЛица КАК ВКМ_ФизическиеЛица
		|ГДЕ
		|	ВКМ_ФизическиеЛица.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Запись.Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если  Выборка.Следующий() Тогда 
		Возврат Выборка.КатегорияСотрудников;
	КонецЕсли;;
		
КонецФункции

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	ВидимостьПроцента();
	
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	ВидимостьПроцента(); 
	
КонецПроцедуры
